app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", ""], ["todo_list_id", 1], ["created_at", "2022-10-12 13:13:54.523140"], ["updated_at", "2022-10-12 13:13:54.523140"]]
---
def create
 @todo_item = @todo_list.todo_items.create(todo_item_params)